package com.test;

import java.net.InetAddress;
import java.net.UnknownHostException;
import java.util.ArrayList;
import java.util.HashSet;
import java.util.Iterator;
import java.util.List;
import java.util.Map;
import java.util.Set;
import java.util.TreeMap;

import com.alibaba.fastjson.JSONObject;

/**
 * 
 * Copyright ©  2017捷通. All rights reserved.
 * @Title: StringUtile.java
 * @ClassName: StringUtile
 * @Description: 字符串测试工具
 * @author: lishihuan
 * @date: 2017年9月21日 下午2:25:44
 */
public class StringUtile {

	
	public static void main(String[] args) {
		
		/*String successMsg  =null;
		 JSONObject transObject = JSONObject.parseObject(successMsg);
        if(transObject==null){
        	System.out.println("1111");
        }else {
        	System.out.println(transObject.getString("ca"));
		}*/
		/* jsonObject.put("ss", "");
		 jsonObject.put("sss", "111");
		
		 System.out.println(jsonObject.toString());*/
		/*testSplit();*/
/*		String content ="{\"content\":\"[{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"嗯;time=60 250\\\",\\\"timestamp\\\":1506239596409,\\\"time\\\":\\\"15:53:16\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"喂;time=5920 6400\\\",\\\"timestamp\\\":1506239598510,\\\"time\\\":\\\"15:53:18\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"喂 你好 哎 请问 您 是 刘超 刘先生 这边 对吗;time=7010 9630\\\",\\\"timestamp\\\":1506239601667,\\\"time\\\":\\\"15:53:21\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"是 的 是;time=10400 11990\\\",\\\"timestamp\\\":1506239603511,\\\"time\\\":\\\"15:53:23\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"嗯;time=16340 16720\\\",\\\"timestamp\\\":1506239608530,\\\"time\\\":\\\"15:53:28\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"嗯;time=17940 18010\\\",\\\"timestamp\\\":1506239610671,\\\"time\\\":\\\"15:53:30\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"喂 你好 刘先生 我 是 中国平安 公司 这边 呢 几个 当班 主管 只限 就是我 上 个 星期 给 您 申 约 好 的 就是 给 您 这边 补充 到 平安 公司 身价 保额 收益 的 就是 因为 您 那个 首期 当时没有 存 让 我们 第二年 跟 您 联系 然后 一直 没有 联系 上;time=11720 27160\\\",\\\"timestamp\\\":1506239618836,\\\"time\\\":\\\"15:53:38\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"就是 那个;time=27760 28840\\\",\\\"timestamp\\\":1506239620821,\\\"time\\\":\\\"15:53:40\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"呃 我 我 我 我 哦 你 说;time=27990 30030\\\",\\\"timestamp\\\":1506239621729,\\\"time\\\":\\\"15:53:41\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"哦;time=36340 36740\\\",\\\"timestamp\\\":1506239628779,\\\"time\\\":\\\"15:53:48\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"嗯;time=40380 40560\\\",\\\"timestamp\\\":1506239632830,\\\"time\\\":\\\"15:53:52\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"对 就是 那个 返还 那个 您 当时 订 的 是 四百 八十五 或者 是 四百 八十五 嘛 我们 首付 的 话 呢 给 您 代扣 三个月 就是 一千四百 五十五 块 钱 因为 它 是 银行 帮 您 扣 的 所以 嗯 就是 跟 您 确认 一下 您 这个 额度 有 转进 来了 吗 刘先生;time=31240 46010\\\",\\\"timestamp\\\":1506239637931,\\\"time\\\":\\\"15:53:57\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"什么;time=48330 48660\\\",\\\"timestamp\\\":1506239640852,\\\"time\\\":\\\"15:54:00\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"a;time=49610 49640\\\",\\\"timestamp\\\":1506239641888,\\\"time\\\":\\\"15:54:01\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"我 就是 您 这个 额度 是 选 进来 了 吗;time=50030 51850\\\",\\\"timestamp\\\":1506239644073,\\\"time\\\":\\\"15:54:04\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"现金 来 是什么 意思;time=53180 54340\\\",\\\"timestamp\\\":1506239646037,\\\"time\\\":\\\"15:54:06\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"嗯;time=61620 61980\\\",\\\"timestamp\\\":1506239653909,\\\"time\\\":\\\"15:54:13\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"嗯;time=65530 65950\\\",\\\"timestamp\\\":1506239658021,\\\"time\\\":\\\"15:54:18\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"对;time=68120 68420\\\",\\\"timestamp\\\":1506239660069,\\\"time\\\":\\\"15:54:20\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"a;time=69270 69300\\\",\\\"timestamp\\\":1506239661037,\\\"time\\\":\\\"15:54:21\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"a;time=70170 70200\\\",\\\"timestamp\\\":1506239663029,\\\"time\\\":\\\"15:54:23\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"对 对;time=71380 71980\\\",\\\"timestamp\\\":1506239664261,\\\"time\\\":\\\"15:54:24\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"a;time=74530 74560\\\",\\\"timestamp\\\":1506239667221,\\\"time\\\":\\\"15:54:27\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"a;time=78250 78280\\\",\\\"timestamp\\\":1506239670176,\\\"time\\\":\\\"15:54:30\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"对;time=81290 81620\\\",\\\"timestamp\\\":1506239674189,\\\"time\\\":\\\"15:54:34\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"嗯;time=85320 85600\\\",\\\"timestamp\\\":1506239678236,\\\"time\\\":\\\"15:54:38\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"您 不记得 了 是 呃 上次 不是 给 您 补充 了 我们 平安 公司 身价 保额 收益 吗 您 这边 的 话 呢 补充 的 话 呢 每个月 定 的 是 四百 八十五 块 钱 呢 我们 第一次 扣费 是 扣 您 三个月 的 吗 就是 四百 八十五 乘以 三个月 不 就是 一千四百 五十五 吗 对不对 因为 那天 的 话 呢 这个 网银 转 因为 您 在;time=56040 74130\\\",\\\"timestamp\\\":1506239678345,\\\"time\\\":\\\"15:54:38\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"外面 不 方便 转 吗 帮 您 觉得 这个 卡 里面 来 所以 的 话 您说 第二天 转到 这个 扣费 的 建行卡 当中 嘛 就是 卡 是 六 二 幺 七 尾号 是 八 七 六 五 的 就 跟 您 确认 一下 您 这边;time=74130 86020\\\",\\\"timestamp\\\":1506239678369,\\\"time\\\":\\\"15:54:38\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"转进 来了 吗;time=86000 86850\\\",\\\"timestamp\\\":1506239679391,\\\"time\\\":\\\"15:54:39\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"没有;time=87620 88100\\\",\\\"timestamp\\\":1506239680218,\\\"time\\\":\\\"15:54:40\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"怎么 还 没 转 进来 呢;time=90410 91570\\\",\\\"timestamp\\\":1506239684320,\\\"time\\\":\\\"15:54:44\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"没 钱;time=92230 92830\\\",\\\"timestamp\\\":1506239685399,\\\"time\\\":\\\"15:54:45\\\",\\\"cmd\\\":\\\"骚扰\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"客户不希望被打扰\\\",\\\"answerType\\\":\\\"6\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"a;time=105390 105420\\\",\\\"timestamp\\\":1506239697502,\\\"time\\\":\\\"15:54:57\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"那 您 第一次 交费 的 话 呢 如果说 这个 卡 也 没有 没有 附加 返还 呢 那 您 可以通过 其他 的 银行 的 就是 储蓄卡 或者 信用卡 代扣 一下 都 可以 留 一个 就 第一次 交费 也 可以 用 信用卡 的 时候 那 这边 的 话 呢 就是 呃 信用卡 可以 付 首付 但是 以后 每个月 交 的 时候 就 不 连 信用卡 只能 用;time=94620 111910\\\",\\\"timestamp\\\":1506239705426,\\\"time\\\":\\\"15:55:05\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"储蓄卡 的;time=111910 112540\\\",\\\"timestamp\\\":1506239705476,\\\"time\\\":\\\"15:55:05\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"好 的;time=113400 113640\\\",\\\"timestamp\\\":1506239706757,\\\"time\\\":\\\"15:55:06\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"所以 就是 后面 过 日期 他 银行 的 卡 代扣 一下 都行 因为我 资料 这些 我 都 已经 帮 您 提交 了;time=113240 118250\\\",\\\"timestamp\\\":1506239710513,\\\"time\\\":\\\"15:55:10\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"哦 我知道 我 现在 我 我 这 我 这边 的 冲程 我 我 白天 都 不是我 转账 在 做事 然后 就是 呃 白天 的 工地 上 不 去 这 是 晚上 再 看 然后 就 嗯 然后 理解 清楚 我 我 嗯 然后 没 钱 没 钱 打 进去;time=116620 135650\\\",\\\"timestamp\\\":1506239728698,\\\"time\\\":\\\"15:55:28\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"嗯;time=137670 138080\\\",\\\"timestamp\\\":1506239730847,\\\"time\\\":\\\"15:55:30\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"我知道 嗯 是 我 跟 您 说过了 嘛 您 第一次 消费 如果说 这个 卡里 没有钱 您 跟 其他 银行 的 信用卡 或者 其他 银行 的 储蓄卡 信用卡 也 可以 付 首付;time=136760 147810\\\",\\\"timestamp\\\":1506239740876,\\\"time\\\":\\\"15:55:40\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"一点 都 不 麻烦 呢;time=149180 150370\\\",\\\"timestamp\\\":1506239742784,\\\"time\\\":\\\"15:55:42\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"好 麻烦 我 我 我 我 这个 迟迟;time=146740 149690\\\",\\\"timestamp\\\":1506239742925,\\\"time\\\":\\\"15:55:42\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"不是;time=151410 151960\\\",\\\"timestamp\\\":1506239744805,\\\"time\\\":\\\"15:55:44\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"肯定 我 信用卡 什么都不知道 身上;time=150760 152510\\\",\\\"timestamp\\\":1506239745935,\\\"time\\\":\\\"15:55:45\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"那 您 这边 的 话;time=154060 154990\\\",\\\"timestamp\\\":1506239747919,\\\"time\\\":\\\"15:55:47\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"什么 意思 那个 明白 我 在 外地;time=153860 155410\\\",\\\"timestamp\\\":1506239748984,\\\"time\\\":\\\"15:55:48\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"嗯;time=158260 158560\\\",\\\"timestamp\\\":1506239752004,\\\"time\\\":\\\"15:55:52\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"不知道;time=160800 161290\\\",\\\"timestamp\\\":1506239754896,\\\"time\\\":\\\"15:55:54\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"不知道 您 在 外地 但是 您 自己 信用卡 什么时候 可以 拿到 的 对不对 因为 我们 这边 的 话 呢 都 已经 给 您 是;time=156740 162250\\\",\\\"timestamp\\\":1506239755872,\\\"time\\\":\\\"15:55:55\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"我们 这边;time=164740 165340\\\",\\\"timestamp\\\":1506239757879,\\\"time\\\":\\\"15:55:57\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"我知道 我知道 我 我 我 我 包括 了 我 打 你们 电话 不 就 不 就 可以 了 吗;time=164180 167880\\\",\\\"timestamp\\\":1506239762028,\\\"time\\\":\\\"15:56:02\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"因为 上次 给 刘先生 对 咱 好 了 我们 这边 呢 资料 都 已经 给 您 做 提交 了;time=169380 173440\\\",\\\"timestamp\\\":1506239766906,\\\"time\\\":\\\"15:56:06\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"a;time=178780 178980\\\",\\\"timestamp\\\":1506239771923,\\\"time\\\":\\\"15:56:11\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"稍后 呢 我 直接 其实 这个 这个 保险 我不愿意 买 的 我 都 都 我 都 都 说的好 读书 都 不用 了 你们 做 一 次 打电话 绿色 之后 说拜拜 本来 我 现在 没 钱 没 钱 我 现在 又 不能 特级 回去 把 这个 钱 交 了 然后 再 过 了;time=172580 185280\\\",\\\"timestamp\\\":1506239778302,\\\"time\\\":\\\"15:56:18\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"敏感人员\\\",\\\"answerType\\\":\\\"8\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"我 说 这 意思 我 这 我 的 地方 事情 嗯;time=186140 188480\\\",\\\"timestamp\\\":1506239782201,\\\"time\\\":\\\"15:56:22\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"我们 这边 的 话 那 您 首付 什么时候 可以 安排 呢;time=187060 189650\\\",\\\"timestamp\\\":1506239783033,\\\"time\\\":\\\"15:56:23\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"我不知道 我 打 你们 电话 不 就 行 了 吗 你们 等 我 就怕;time=190140 192550\\\",\\\"timestamp\\\":1506239786304,\\\"time\\\":\\\"15:56:26\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"嗯;time=195360 195690\\\",\\\"timestamp\\\":1506239789197,\\\"time\\\":\\\"15:56:29\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"a;time=197530 197560\\\",\\\"timestamp\\\":1506239791194,\\\"time\\\":\\\"15:56:31\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"a;time=206160 206190\\\",\\\"timestamp\\\":1506239799315,\\\"time\\\":\\\"15:56:39\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"刘先生 我们 是 您 客户 的 这个 名单 它 系统 是 统一 下发 统一 做 回收 的 刘先生 不是 说 跟 您 以后 您 什么时候 有钱 有 时间 了 您 自己 有 在 这个 钱 也 花钱 是 我们 市面上 根本 办理 不 了 这个项目 明白 吗 他 这个 不是 您 可能 误会 了;time=194300 209330\\\",\\\"timestamp\\\":1506239802310,\\\"time\\\":\\\"15:56:42\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"我知道 那 那 我 就 不 办 了 就是了;time=207700 210020\\\",\\\"timestamp\\\":1506239803369,\\\"time\\\":\\\"15:56:43\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"我 这边;time=210600 210850\\\",\\\"timestamp\\\":1506239805342,\\\"time\\\":\\\"15:56:45\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"取消 您看;time=211280 212040\\\",\\\"timestamp\\\":1506239805416,\\\"time\\\":\\\"15:56:45\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"你 看 行不行 都 有钱了 然后 在 咱们 的 话 才 办;time=213800 216740\\\",\\\"timestamp\\\":1506239810357,\\\"time\\\":\\\"15:56:50\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"大;time=219420 219620\\\",\\\"timestamp\\\":1506239813337,\\\"time\\\":\\\"15:56:53\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"可不可以 省 那你 今天 也 把 我 电话;time=217660 219800\\\",\\\"timestamp\\\":1506239813435,\\\"time\\\":\\\"15:56:53\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"好不好;time=220840 221280\\\",\\\"timestamp\\\":1506239814388,\\\"time\\\":\\\"15:56:54\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"我们 给 刘 女士 打电话 我们 不是 说 去 给 您 选 全额 推销 市面上 或者 柜台 您 的 授权 的 程序 业务 明白 吗 那 我们 在 柜台 能够 对外;time=221380 228970\\\",\\\"timestamp\\\":1506239823508,\\\"time\\\":\\\"15:57:03\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"我知道 我 我 但是 我 但是 我 说 的 意思 因为我 我 经济状况 在这里 我 现在 没 钱 交 这 第 一点 就是 我们 现在 这个 我们 这个地方 都 充 乘坐 交通 成 我不知道 你 都 不懂 就 白天 补给站 和 晚上 才能 搞 和 投资 该;time=227670 242990\\\",\\\"timestamp\\\":1506239836798,\\\"time\\\":\\\"15:57:16\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"我 说 的 意思 你们 吧 白天 不 变化 和 就 白天 把 查得 不好意 怎么 去 还款;time=244340 248670\\\",\\\"timestamp\\\":1506239842664,\\\"time\\\":\\\"15:57:22\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"嗯;time=249800 250120\\\",\\\"timestamp\\\":1506239843630,\\\"time\\\":\\\"15:57:23\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"什么 老板 嗯 因为我 规定 就 我们 这里 这 张 进度 然后 利率 的 干活 完 拒绝 九点钟 才 才 可以 才 可以 干活 就 报修;time=249280 258910\\\",\\\"timestamp\\\":1506239852649,\\\"time\\\":\\\"15:57:32\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"我 是 可以 装;time=260210 260830\\\",\\\"timestamp\\\":1506239854838,\\\"time\\\":\\\"15:57:34\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"所以 所以 我们 我们 我们 晚上 在 干事 白天 还在 睡觉;time=262430 265690\\\",\\\"timestamp\\\":1506239859794,\\\"time\\\":\\\"15:57:39\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"对;time=266900 266980\\\",\\\"timestamp\\\":1506239860707,\\\"time\\\":\\\"15:57:40\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"我 刚刚 才 行;time=266200 266940\\\",\\\"timestamp\\\":1506239860891,\\\"time\\\":\\\"15:57:40\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"我知道;time=272740 273340\\\",\\\"timestamp\\\":1506239867797,\\\"time\\\":\\\"15:57:47\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"对啊;time=275320 275660\\\",\\\"timestamp\\\":1506239869859,\\\"time\\\":\\\"15:57:49\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"嗯;time=277460 277840\\\",\\\"timestamp\\\":1506239871873,\\\"time\\\":\\\"15:57:51\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"对;time=282260 282560\\\",\\\"timestamp\\\":1506239876828,\\\"time\\\":\\\"15:57:56\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"嗯 其实 首播 并不 是 很多 才 一千四百多 块 钱 我 刘先生 您 自己 的 话 呢 做 核对 仔细 安排 这个 钱 您 肯定 会 安排 出来 的 对不对 因为 我们 这个 跟 您 不是 说 上次 的 话 呢 本来 也是 跟 您 约 好 了 对不对 如果说 刘先生 您 自己 首付 安排 不 了 我相信你 也 不会 说 给 自己 办理 进来 了;time=268230 287000\\\",\\\"timestamp\\\":1506239880931,\\\"time\\\":\\\"15:58:00\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"对不对 因为 如果说 今天 首付 让 您 付 个 一两万;time=287580 290240\\\",\\\"timestamp\\\":1506239884012,\\\"time\\\":\\\"15:58:04\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"一;time=292580 292700\\\",\\\"timestamp\\\":1506239887075,\\\"time\\\":\\\"15:58:07\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"其实 我不想 办 的 保险 的 我 不骗你 我 只 你们 老 打电话 我 说 办 办 保 什么 你们 打电话 三十八;time=289580 296120\\\",\\\"timestamp\\\":1506239889985,\\\"time\\\":\\\"15:58:09\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"敏感人员\\\",\\\"answerType\\\":\\\"8\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"然后 嗯;time=296620 297630\\\",\\\"timestamp\\\":1506239892149,\\\"time\\\":\\\"15:58:12\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"一年来 保单 您 交 十年 保 二 十年 收益 给 您 百分之十 二 你 都 交 了 八百 十二 现在 给 您 补 的 独立 新 买 的 您 同样 交 十年 再说吧;time=296410 304240\\\",\\\"timestamp\\\":1506239898093,\\\"time\\\":\\\"15:58:18\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"我 八百 三十二 不是 所有 欠了你 两个月 没 交 了 吗;time=303240 306280\\\",\\\"timestamp\\\":1506239900098,\\\"time\\\":\\\"15:58:20\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"嗯 这个 的 话 呢 有 个 六十天 的 宽 限期 和 两年 时间 复 效期 嘛 反正 只要 说 在 两年之内 完了 最后 一点 是 您 附加 不 上来 合同 继续 有效 中间 没有 也 没有 滞纳金 没有任何 利息 的 明白 吧;time=308220 319070\\\",\\\"timestamp\\\":1506239913274,\\\"time\\\":\\\"15:58:33\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"我知道;time=319020 319510\\\",\\\"timestamp\\\":1506239914177,\\\"time\\\":\\\"15:58:34\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"我 就;time=325100 325340\\\",\\\"timestamp\\\":1506239919251,\\\"time\\\":\\\"15:58:39\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"你 看 这样 行不行 我 我 我 都 都 有 时间 回去 我 我 或者 我 把 取 或者 要不然 你 就 现在 暂时 帮我 取消 掉 我 就 这 两种 办法 我 不能 我 以前;time=320140 329350\\\",\\\"timestamp\\\":1506239924381,\\\"time\\\":\\\"15:58:44\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"10156\\\",\\\"talkertype\\\":\\\"1\\\",\\\"content\\\":\\\"那 行 吧 没问题 吧 刘先生 那 您 自己 这边 先 看一下 吧 好吧;time=328570 331640\\\",\\\"timestamp\\\":1506239926259,\\\"time\\\":\\\"15:58:46\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"684b03eea0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"},{\\\"id\\\":\\\"018905659890\\\",\\\"talkertype\\\":\\\"2\\\",\\\"content\\\":\\\"可以 可以 谢谢你 了 啊;time=331900 332940\\\",\\\"timestamp\\\":1506239927336,\\\"time\\\":\\\"15:58:47\\\",\\\"cmd\\\":\\\"\\\",\\\"userphone\\\":\\\"018905659890\\\",\\\"channelId\\\":\\\"682ac764a0fd11e7\\\",\\\"answer\\\":\\\"\\\",\\\"answerType\\\":\\\"3\\\"}]\",\"fileId\":\"1506241263-997122\",\"callCenter\":1,\"callTime\":\"2017-09-24 15:53:16\",\"voiceId\":\"1506241263-997122\",\"seatId\":\"10156\",\"callPhone\":\"018905659890\",\"voicePath\":\"\",\"platForm\":\"XQD-SHW\"}";
		JSONObject jsonObject = JSONObject.parseObject(content);
		System.out.println(jsonObject.getString("callPhone"));
	*/
		
		/*String cString ="13875,981,9944,7009,14102,5442,";
		Set<String> set=new HashSet<>();
		set.add("13875");
		set.add("981");
		System.out.println(set.size());
		set.add("9810");
		System.out.println(set.size());
		if (set.contains("1387")) {
			System.out.println("包含");
		}*/
		
		/*Stringdian("sss","sfsf","sfs","assdf");*/
		
		/*Map<String, String> getenv = System.getenv();
		try {
			System.out.println((InetAddress.getLocalHost()).getHostName());
		} catch (UnknownHostException e) {
			// TODO Auto-generated catch block
			e.printStackTrace();
		}
	    Set<String> keySet = getenv.keySet();
	    for (String string : keySet) {
			System.out.println(string+":"+getenv.get(string));
			
		}*/
		/*StringBuffer stringBuffer = new StringBuffer();
		stringBuffer.append("1s67ss\nss");
		String substring = stringBuffer.substring(0, stringBuffer.length()-1);
	
		System.out.println(substring);
		*/
		/*String ss ="[用户] 喂文件";
		System.out.println(ss.substring(1, 3));*/
		//String ss="<?xml version=\"1.0\" encoding=\"UTF-8\"?><soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"><soapenv:Body><ns:QuerySpeechResponse xmlns:ns=\"http://vie.services.com\"><ns:return>&lt;?xml version=\"1.0\" encoding=\"UTF-8\"?&gt;&lt;response&gt;&lt;functionResult&gt;0&lt;/functionResult&gt;&lt;resultMessage&gt;&lt;/resultMessage&gt;&lt;/response&gt;</ns:return></ns:QuerySpeechResponse></soapenv:Body></soapenv:Envelope>";
		//System.out.println(ss.replaceAll("&gt;", ">"));
	/*	String ctiCode ="abc19200ss";
		ctiCode = ctiCode.replaceAll("[a-zA-Z]","" );  
		System.out.println(ctiCode);*/
		//解析加密内容获得参数（timestamp=1513137737250&notice=463328&signature=wY+CQ7qdOnnFOdBOdQUHKwOXzfA=）
		/*String aesP = "timestamp=1513137737250&notice=463328&signature=wY+CQ7qdOnnFOdBOdQUHKwOXzfA=";
	    String[] arrayP = aesP.split("&");
	    String timestamp =arrayP[0].substring(arrayP[0].indexOf("=")+1, arrayP[0].length());
	    String notice = arrayP[1].substring(arrayP[1].indexOf("=")+1, arrayP[1].length());;
	    String signature = arrayP[2].substring(arrayP[2].indexOf("=")+1, arrayP[2].length());;
	    
	    
	    for (String param : arrayP) {
			System.out.println(param);
			
			
		}
	    System.out.println(timestamp);
	    System.out.println(notice);
	    System.out.println(signature);*/
	    
	  //验签
		
	  		/*String signature =externalRequest.getSignature();//接收签名
	  		System.out.println("参数签名:"+signature);
	  		String nonce =externalRequest.getNotice();//接收随机数
	  		String timestamp =externalRequest.getTimestamp();//接收时间戳
	  		
	  		String appKey =SystemParameter.getAPPKEY();//系统密钥
	  		
	  		System.out.println("时间戳:"+timestamp+"随机数nonce:"+nonce+"appKey"+appKey);
	  		String mySignature = SignUtil.getSignature(timestamp, nonce, appKey);//根据参数生成签名
	  		System.out.println("参数签名:"+signature);
	  		System.out.println("根据参数生成的签名:"+mySignature);
	  		
	  		if (!mySignature.equals(signature)) {
	  		    model.addAttribute("errorMsg", "非法请求，验签不通过！");
	  		    
	  		    JSONObject jsonObject = new JSONObject();
	  			jsonObject.put("errorCode", "1");
	  			jsonObject.put("errorMsg", "非法请求，验签不通过！");
	  			jsonObject.put("retMsg", "false");
	  			model.addAttribute("ret", jsonObject.toJSONString());
	  		    
	  		    
	  			return "/monitor/seatRealErro";
	  		}*/
	  		
	  		//验签结束
		testTreeMap();
	
		
		
	
	}
	
	/**
	 * 确定字符串替换，用replace性能略好！如果有大量不确定字符串，replaceAll+正则性能会更好
	 * replaceAll可正则
	 */
	public static void testSplit(){
		
		String content = "测试  空格  替换  类    ";
		String content1 = " ";
		System.out.println(content.trim());
		System.out.println(content.replace(" ", ""));
		System.out.println(content1.replace(" ", ""));
	}
	/**
	 * 
	 * @Title: String...
	 * @Description: 参数为不定数目
	 * @param values void
	 */
	public static void Stringdian(String... values){
		
		for (String string : values) {
			System.out.println(string);
		}
		
	}

	
	public static void sortList(){
		
		
		
		
		
	}
	
	
	public static void testTreeMap(){
		
		 /*TreeMap<Integer,Integer> map1 = new TreeMap<Integer,Integer>();  //默认的TreeMap升序排列  
	      map1.descendingMap();
	      map1.put(1,2);  
	      map1.put(2,4);  
	      map1.put(7, 1);  
	      map1.put(5,2);  
	      System.out.println("map1="+map1);  */
		System.out.println(Integer.MAX_VALUE);
		
		TreeMap<Integer, String>  treeMap = new TreeMap<>();
		
		treeMap.put(10060, "1");
		treeMap.put(12500, "2");
		treeMap.put(13600, "3");
		treeMap.put(16980, "4");
		treeMap.put(17700, "5");
		treeMap.put(21620, "6");
		treeMap.put(26890, "7");
		treeMap.put(28400, "8");
		treeMap.put(340, "9");
		treeMap.put(28400, "10");
		treeMap.put(45280, "11");
		treeMap.put(1, "12");
		Iterator<Integer> iterator = treeMap.keySet().iterator();
		while (iterator.hasNext()) { 
			Integer key = iterator.next();
			System.out.println("key:"+key+"__"+treeMap.get(key));
		}
		
		
	}
	
}
